Процедура Подготовка()
	Спр = Справочники.Номенклатура.НайтиПоКоду("1");
КонецПроцедуры

Функция Сумма(Знач А, Знач Б = 0) Экспорт
	Возврат ?(А > Б, А + Б, Б);
КонецФункции

Процедура Обработать(Список) Экспорт
	Структура = Новый Структура("Код, Имя", 1, "Первый");
	Для Каждого Элемент Из Список Цикл
		Если Элемент = Неопределено Тогда
			Продолжить;
		ИначеЕсли Элемент > 10 Тогда
			Прервать;
		Иначе
			Счетчик = Сумма(Структура.Код, Элемент);
		КонецЕсли;
	КонецЦикла;
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ 1 КАК Поле ГДЕ Поле = &Параметр");
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры
